tutorial/sixDoF_2D/deformMesh/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (-100 -100 -100) (100 100 0.0);
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }

    //boxToCell
    //{
    //    box (0.7 0.8 -100) (100 100 0.65);
    //    fieldValues ( volScalarFieldValue alpha.water 1 );
    //}
);


// ************************************************************************* //
